package answers;

public class Film extends BaseFilmTopicConversation {
	public static final String[] films = { "Сплит", "Живая сталь", "Железный человек", "Виноваты звёзды", "Время",
			"Первому игроку приготовиться", "Мстители", "Дома странных детей", "Kingsman", "Нерв", "Великий Гэтсби",
			"Люси", "Пираты Карибского моря", "Малыш на драйве", "Аннигиляция", "Интерстеллар",
			"Отличница лёгкого поведения", "Гарри Поттер", "Джуманджи", "Одарённая", "Скрытые фигуры", "Оно", "Чудо",
			"Джунгли", "Атландида", "Книга Генри", "До костей", "Между нами горы", "Очень плохие девчонки",
			"По соображениям совести" };

	private static final String[] triggers = {"(?iu:фильм|фильмец)", "(?iu:какой\\s.*фильм)", "(?iu:подскажи\\s.*фильм)", "(?iu:посоветуй\\s.*фильм)"};

	public Film() {
		super(triggers, films);
	}
}
